chunyen627-afk/stm32h7s78-project/projects/album/app_src/usbaudio.c
/**
 * USB 無線耳機（USB Host / UAC1）——— 第一階段：讓它活起來。
 *
 * 說明見 usbaudio.h。底層的 LL 膠合在 usbh_glue.c。
 */
#include "usbaudio.h"

#include "main.h"          /* CMSIS 的暫存器定義與 HAL */
#include "usbh_core.h"
#include "usbh_audio.h"
#include "stm32h7rsxx_hal_hcd.h"
#include "stm32h7s78_discovery_sd.h"

#include <string.h>

/* --- 觀察手段：DTCM 黑盒子 --------------------------------------------
 * 相簿沒有 UART（治具那邊有，因為 ST 的範例把訊息印到 UART4）。
 * 這裡沿用相簿既有的做法：把狀態寫進 DTCM，重置洗不掉，用 SWD 讀。
 * album_main.c 的黑盒子在 0x20004020，用到 147 號；USB 這邊從 160 開始，
 * 不會撞。
 *
 * **哨兵 0xFFFFFFFF = 這段根本沒跑到**，跟「跑了但結果是 0」分得開 ——
 * board-notes 8.7，而且我在治具那邊才因為沒守這條誤判過兩輪。 */
#define UBOX        ((volatile uint32_t *)0x20004020u)
#define UB_MAGIC    160   /* 0x55534231 "USB1"，證明這段程式真的執行過 */
#define UB_INIT     161   /* usbaudio_init 各步驟的位元圖 */
#define UB_STATE    162   /* 應用層狀態：0 閒置 1 已連接 2 類別就緒 3 斷線 */
#define UB_VIDPID   163   /* (VID << 16) | PID */
#define UB_PROC     164   /* usbaudio_process 呼叫次數（主迴圈驅動）*/
#define UB_GSTATE   165   /* USBH 核心的 gState */
#define UB_ALLOC    166   /* 靜態配置器用掉的最大位元組數 */
#define UB_ALLOCERR 167   /* 配置失敗次數（不是 0 就代表緩衝太小）*/
#define UB_ALT      168   /* (interface << 16) | alt setting */
#define UB_EPSIZE   169   /* 類別挑到的端點大小 */

#define UB_INIT_ENTER   (1u << 0)
#define UB_INIT_HOSTOK  (1u << 1)
#define UB_INIT_CLASSOK (1u << 2)
/* 開播要走一串非同步的控制傳輸，每一筆都要重試到 USBH_OK，所以是狀態機。
 * **順序不能換**：取樣率是設在「目前這個 alt 的端點」上的，而 alt 由類別
 * 在 ClassRequest 階段就設好了（按格式挑，見 patch_project.py）。 */
typedef enum {
    US_IDLE = 0,
    US_UNMUTE,      /* 解除靜音 —— ST 的類別從來不做這件事 */
    US_VOL1,        /* 音量：聲道 1 */
    US_VOL2,        /* 音量：聲道 2（主聲道常常只有靜音沒有音量）*/
    US_FREQ,        /* 取樣率 */
    US_PLAY,        /* USBH_AUDIO_Play */
    US_PLAYING,
    US_ENDED,
} usb_stream_state_t;

static volatile uint8_t s_state;   /* 初值 0 = US_IDLE */

#define UB_INIT_STARTOK (1u << 3)

/* --- 診斷（接在前面那批後面）--- */
#define UB_STREAM   170   /* 串流狀態機走到哪 */
#define UB_UNDER    171   /* 可播存量掉到 1/4 以下的次數（掏空的前兆）*/
#define UB_OVER     172   /* 類別衝出緩衝結尾的次數（應該永遠是 0）*/
#define UB_PUMPCNT  173   /* TIM7 中斷次數 */
#define UB_RDERR    174   /* f_read 失敗次數 */
#define UB_POSMS    175   /* 目前播放位置（毫秒）*/
/* --- 下面這幾格**刻意不在 init 清空** ------------------------------------
 * 用 SWD 讀 DTCM 必須 mode=UR，而 UR 會重置板子 —— 讀一次就洗掉一次現場。
 * 所以「當機那一輪」的證據要放在重置也不會被歸零的格子裡，跟相簿
 * BBOX[2]/[3]（上一輪最後的階段與 tick）同一個道理。
 *
 * 判讀方式：把 UB_TICK 跟相簿的 BBOX[3] 比 ——
 *   兩個都停在差不多的時間 -> 整個主迴圈停了
 *   BBOX[3] 一直在走而 UB_TICK 停住 -> 主迴圈活著但沒再進到音訊這條路 */
#define UB_TICK     176   /* 最後一次進到 usbaudio_wav_pump 的 HAL_GetTick */
#define UB_STARTS   177   /* start 呼叫累計 */
#define UB_STOPS    178   /* stop 呼叫累計 */
#define UB_SEEKS    179   /* seek 呼叫累計 */
#define UB_PAUSES   180   /* pause 呼叫累計 */
#define UB_NOTCLASS 181   /* 中斷進來時類別不在 HOST_CLASS 的次數 */
/* --- 把搜尋空間一刀切半的兩個麵包屑 ------------------------------------
 * 182：pump 被呼叫幾次。相簿的影片節奏是
 *      `while (next_ms > HAL_GetTick()) { audio_wav_pump(); }`，
 *      所以這個數字大得離譜 = 卡在那個忙等；沒在動 = 卡在別的地方。
 * 183：seek 走到哪一步。seek 是唯一可重現的觸發點，要能分辨它是
 *      「卡在 seek 裡面」還是「seek 做完之後才出事」。 */
#define UB_PUMPCALLS 182
#define UB_SEEKSTEP  183   /* 1 進入 2 已 Stop 3 已 lseek 4 已 prefill 5 完成 */
#define UB_STARTRET  184   /* USBH_Start 的實際回傳值 */
/* 186/187：把「有沒有被呼叫」跟「有沒有通過檢查」分開。
 * PROC 讀到 0 但呼叫端明明在跑 —— 這種矛盾不能靠推理解決，
 * 要把單一計數拆成兩個獨立的事實。 */
#define UB_PROCENTRY 186   /* usbaudio_process 進入次數（任何檢查之前）*/
#define UB_INITED    187   /* s_inited 的即時值 */
/* 181/182 原本要記 HardFault，但 HardFault_Handler 在 cube 的 it.c 已經有
 * 非弱定義，應用層覆寫不了 —— 要記就得改 it.c（patch_project.py 的工作）。
 * 先不做：NULL 檢查本來就該加，加完再看還當不當。 */


/* --- 靜態配置器 -------------------------------------------------------
 * USBH_malloc 在 usbh_conf.h 被導到這裡。**不用 malloc** 的理由寫在那邊：
 * 堆疊只有 1536 bytes，而且之後狀態機要進中斷。
 *
 * 類別只配置一次（AUDIO_HandleTypeDef），所以不需要真的做釋放 ——
 * 但要能分辨「沒配置過」與「配置失敗」，所以失敗有自己的計數。 */
static uint8_t  s_pool[3072] __attribute__((aligned(8)));
static uint32_t s_pool_used = 0u;

void *usbh_static_alloc(uint32_t size)
{
    uint32_t need = (size + 7u) & ~7u;

    if ((s_pool_used + need) > sizeof(s_pool)) {
        UBOX[UB_ALLOCERR]++;
        return NULL;
    }
    {
        void *p = &s_pool[s_pool_used];

        s_pool_used += need;
        if (s_pool_used > UBOX[UB_ALLOC]) {
            UBOX[UB_ALLOC] = s_pool_used;
        }
        return p;
    }
}

void usbh_static_free(void *p)
{
    (void)p;   /* 只配置一次，不必回收。 */
}

/* --- 主機控制代碼 ----------------------------------------------------- */
USBH_HandleTypeDef hUsbHostFS;
extern HCD_HandleTypeDef hhcd_USB_OTG_FS;

/* USB 改成純輪詢（NVIC 的 OTG 中斷是關掉的，見 usbh_glue.c 的說明）。
 * 這一個函式就是「服務一次 USB」：先處理硬體事件，再推狀態機。 */
static void usb_poll(void)
{
    /* 卡死探針（188 號）：凍結時匯流排整個鎖死、連 SWD 都進不去，
     * 所以「凍住那一刻 CPU 在讀哪個從屬」只能靠前後腳印回推。
     * 1 = 卡在 HAL_HCD_IRQHandler（OTG 暫存器）、2 = 卡在 USBH_Process、
     * 0 = 不在 usb_poll 裡。 */
    UBOX[188] = 1u;
    HAL_HCD_IRQHandler(&hhcd_USB_OTG_FS);
    UBOX[188] = 2u;
    (void)USBH_Process(&hUsbHostFS);
    UBOX[188] = 0u;
}

/* 應用層看到的狀態。**volatile**：TIM7 的中斷之後也會改到相關狀態。 */
static volatile uint8_t s_appli = 0u;   /* 0 閒置 1 已連接 2 就緒 3 斷線 */
static volatile uint8_t s_inited = 0u;

/* 冷上電後 dongle 無聲的問題**決定不修**（2026-08-27，使用者的取捨）：
 * 唯一有效的軟體修法是「開機約 40 秒後補一次列舉」（dongle 通電要約
 * 半分鐘才真正就緒，太早列舉綁出來的音訊路徑是壞的 —— 10~12 秒重來
 * 全部無效、36 秒以後重來全部有效，都實測），但使用者說手動重插比
 * 等 40 秒快，自動重置又會讓掃卡跑兩次。所以維持現狀：**冷上電後
 * 重插一次 dongle 即可**。完整量測記錄在 projects/usbaudio/README.md。 */

/* 抽送權在誰身上：false = 主迴圈（nap）、true = TIM7 的中斷。
 * 定義放前面是因為 usbaudio_process() 要用到，而它在 pump_start 之前。 */
static volatile bool s_pump_on = false;

static AUDIO_HandleTypeDef *class_handle(void);   /* 定義在下面 */

static void usb_user_process(USBH_HandleTypeDef *phost, uint8_t id)
{
    switch (id) {
    case HOST_USER_DISCONNECTION:
        s_appli = 3u;
        UBOX[191]++;               /* 斷線次數（本輪開機） */
        /* **類別沒了就要立刻收攤。** 不收的話 pump 還會繼續呼叫
         * GetOutOffset / ChangeOutBuffer，而那些函式內部也會去
         * 解參照 pActiveClass。 */
        s_state = US_IDLE;
        s_pump_on = false;
        TIM7->CR1  = 0u;
        TIM7->DIER = 0u;
        break;

    case HOST_USER_CLASS_ACTIVE:
        s_appli = 2u;
        /* 190：類別掛上的時刻與次數（(次數<<24)|tick）。查「冷上電要重插
         * dongle 才有聲音」用 —— 分辨列舉是太晚完成、還是反覆重來。 */
        UBOX[190] = ((UBOX[190] >> 24) + 1u) << 24 |
                    (HAL_GetTick() & 0x00FFFFFFu);
        UBOX[UB_VIDPID] = ((uint32_t)phost->device.DevDesc.idVendor << 16) |
                          phost->device.DevDesc.idProduct;
        {
            AUDIO_HandleTypeDef *h = (phost->pActiveClass != NULL)
                ? (AUDIO_HandleTypeDef *)phost->pActiveClass->pData : NULL;

            if (h != NULL) {
                UBOX[UB_ALT] = ((uint32_t)h->headphone.interface << 16) |
                               h->headphone.AltSettings;
                UBOX[UB_EPSIZE] = h->headphone.EpSize;
            }
        }
        break;

    case HOST_USER_CONNECTION:
        s_appli = 1u;
        break;

    default:
        break;
    }
    UBOX[UB_STATE] = s_appli;
}

/* 二分法分級：
 *   1 = 只調 SysTick 優先權（其餘什麼都不做）
 *   2 = + USBH_Init（含 HAL_HCD_Init 與 MspInit：LSE/CRS/HSI48 時脈）
 *   3 = + USBH_RegisterClass
 *   4 = + USBH_Start（埠供電）
 * 症狀是「USB 初始化過就會讓相簿原本的 I2S seek 卡住」，
 * 而 seek 那條路跟 USB 毫無交集 —— 所以要找的是 init 動到的**共用資源**。 */
/*   5 = 只開 OTG 全域中斷，**不驅動 VBUS**
 *   6 = 只驅動 VBUS，**不開全域中斷**
 * level 2 通過、level 4 當機，而 USBH_Start 就只做這兩件事。 */
#define USBAUDIO_INIT_LEVEL  4

void usbaudio_init(void)
{
    /* 斷電後第一次才清累計欄。**用 SWD 讀 DTCM 必須 mode=UR，而 UR 會重置**
     * —— 每次讀就重置一次，若在這裡無條件清空，累計值永遠讀不到。
     * 但也不能完全不初始化：DTCM 斷電後是隨機內容，`UBOX[x]++` 會從垃圾
     * 開始加，看起來還是垃圾（我第一版就是這樣，讀回四個亂數）。
     * 相簿的黑盒子用同一招（BBOX[0] 的 magic）。 */
    if (UBOX[UB_MAGIC] != 0x55534231u) {
        UBOX[UB_TICK]   = 0u;
        UBOX[UB_STARTS] = 0u;
        UBOX[UB_STOPS]  = 0u;
        UBOX[UB_SEEKS]  = 0u;
        UBOX[UB_PAUSES] = 0u;
        UBOX[UB_NOTCLASS] = 0u;
        UBOX[UB_PUMPCALLS] = 0u;
        UBOX[UB_SEEKSTEP] = 0u;
    }

    /* **每一輪開機都要把本輪會寫的欄位歸零。**
     * 這是我這一輪踩到的第三個儀器缺陷：STARTRET / SEEKSTEP / STREAM
     * 沒有歸零，於是上一次開機留下的值被我當成本輪的事實 ——
     * 「USBH_Start 有回來」其實是上一輪的紀錄。
     * 累計欄（TICK/STARTS/...）另外處理，只在斷電後第一次清。 */
    UBOX[UB_STARTRET]  = 0xFFFFFFFFu;
    UBOX[UB_SEEKSTEP]  = 0xFFFFFFFFu;
    UBOX[UB_STREAM]    = 0xFFFFFFFFu;
    UBOX[UB_PROCENTRY] = 0u;
    UBOX[UB_INITED]    = 0xFFFFFFFFu;
    UBOX[188]          = 0xFFFFFFFFu;   /* 卡死探針：0xFFFFFFFF = 還沒跑到 */
    UBOX[189]          = 0xFFFFFFFFu;
    UBOX[190]          = 0u;            /* 類別掛上：(次數<<24)|tick */
    UBOX[191]          = 0u;            /* 斷線次數 */

    UBOX[UB_MAGIC]    = 0x55534231u;
    UBOX[UB_INIT]     = UB_INIT_ENTER;
    UBOX[UB_STATE]    = 0u;
    UBOX[UB_VIDPID]   = 0xFFFFFFFFu;
    UBOX[UB_PROC]     = 0u;
    UBOX[UB_GSTATE]   = 0xFFFFFFFFu;
    UBOX[UB_ALLOC]    = 0u;
    UBOX[UB_ALLOCERR] = 0u;
    UBOX[UB_ALT]      = 0xFFFFFFFFu;
    UBOX[UB_EPSIZE]   = 0xFFFFFFFFu;

/* 這裡原本有一行 HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0)，
     * 是為了「USB 中斷餓死 SysTick」那個假設加的。那個假設後來被推翻
     * （改成輪詢之後根本沒有 USB 中斷），而且它自己成了新的嫌疑 ——
     * USBH_Start 卡在 HAL_Delay(200) 只有一個解釋：uwTick 不動。
     * 拿掉它，讓 SysTick 回到 HAL 的預設。 */

