chunyen627-afk/stm32h7s78-project/projects/album/app_src/usbaudio.c
#if (USBAUDIO_INIT_LEVEL < 2)
    return;
#endif

    if (USBH_Init(&hUsbHostFS, usb_user_process, HOST_FS) != USBH_OK) {
        return;
    }
    UBOX[UB_INIT] |= UB_INIT_HOSTOK;

    /* **USBH_Init 一成功就開始服務。**
     * 原本是等到 USBH_Start 之後才設 s_inited，而中間任何一步出狀況
     * （或我對 INIT 位元的判讀出錯）都會讓 usbaudio_process() 一直空轉 ——
     * 那等於「OTG 中斷開著卻沒有人服務它」，實測就會把相簿卡死。
     * USBH_Process 在還沒 Start 的時候本來就是安全的（狀態機停在 IDLE）。 */
    s_inited = 1u;

#if (USBAUDIO_INIT_LEVEL < 3)
    return;
#endif

    if (USBH_RegisterClass(&hUsbHostFS, USBH_AUDIO_CLASS) != USBH_OK) {
        return;
    }
    UBOX[UB_INIT] |= UB_INIT_CLASSOK;

#if (USBAUDIO_INIT_LEVEL < 4)
    return;
#endif

    /* 麵包屑：INIT 讀到 7 但 USBH_Start 的實作是**無條件回傳 USBH_OK**，
     * 兩者矛盾 —— 所以我對這裡的模型一定有錯。不要再推，讓位元自己說。
     * 0x10 = 呼叫之前、0x20 = 呼叫回來了、0x40 = 判斷式也過了。 */
    UBOX[UB_INIT] |= 0x10u;
#if (USBAUDIO_INIT_LEVEL == 5)
    /* 只開全域中斷（HAL_HCD_Start 的一半）。VBUS 由 JP1 供，硬體上本來
     * 就有電，所以不驅動 PPWR 也還是接得上。 */
    __HAL_HCD_ENABLE((HCD_HandleTypeDef *)hUsbHostFS.pData);
    UBOX[UB_INIT] |= 0x20u;
    s_inited = 1u;
    UBOX[UB_INIT] |= UB_INIT_STARTOK;
    return;
#elif (USBAUDIO_INIT_LEVEL == 6)
    /* 只驅動 VBUS（HAL_HCD_Start 的另一半），不開全域中斷。 */
    (void)USB_DriveVbus(((HCD_HandleTypeDef *)hUsbHostFS.pData)->Instance, 1U);
    UBOX[UB_INIT] |= 0x20u;
    s_inited = 1u;
    UBOX[UB_INIT] |= UB_INIT_STARTOK;
    return;
#endif
    /* 把 USBH_Start 拆開，讓黑盒子指出是哪一個呼叫不回來。
     * USBH_Start 本身只有這兩行（usbh_core.c），而且都不該會等。 */
    UBOX[UB_STARTRET] = 0xA0u;
    (void)USBH_LL_Start(&hUsbHostFS);
    UBOX[UB_STARTRET] = 0xA1u;
    (void)USBH_LL_DriverVBUS(&hUsbHostFS, 1U);
    UBOX[UB_STARTRET] = 0xA2u;
    UBOX[UB_INIT] |= 0x20u;

    UBOX[UB_INIT] |= 0x40u;

#if (USBAUDIO_INIT_LEVEL == 4)
    /* 二分：照樣 USBH_Start（埠供電照做），但把 NVIC 的 OTG 中斷關掉。
     * 這樣就分得出「當機是供電造成的」還是「中斷造成的」。
     * 注意 OTG 中斷計數器讀到的是隨機值，代表它從來沒觸發過 ——
     * 所以我預期關掉它不會有差別；**如果有差別，就代表那個計數器在騙我**，
     * 那本身也是重要資訊。 */
    HAL_NVIC_DisableIRQ(OTG_FS_IRQn);
    UBOX[UB_INIT] |= 0x80u;
#endif

    UBOX[UB_INIT] |= UB_INIT_STARTOK;

    s_inited = 1u;
}

void usbaudio_process(void)
{
    UBOX[UB_PROCENTRY]++;          /* **任何檢查之前** */
    UBOX[UB_INITED] = s_inited;

    if (s_inited == 0u) {
        return;
    }

    /* **抽送權交出去之後主迴圈就不能再進來。**
     * 同一個狀態機被中斷與主迴圈同時跑會互相踩 —— 治具那邊有旗標擋，
     * 這裡第一版忘了加。s_pump_on 由 pump_start/stop 維護。 */
    if (s_pump_on) {
        return;
    }

    UBOX[UB_PROC]++;
    UBOX[UB_GSTATE] = (uint32_t)hUsbHostFS.gState;

    usb_poll();
}

bool usbaudio_ready(void)
{
    return (s_appli == 2u);
}

/* 「會話活躍」= 主機起來了而且 dongle 在線（已連接或類別就緒）。
 * 給 play_video() 判斷要不要關 D-Cache 用（見 album_main.c 的說明）——
 * 判斷條件刻意比 usbaudio_ready() 寬：凍死不需要類別就緒，
 * dongle 一連上、會話一跑起來就有毒。 */
bool usbaudio_session_active(void)
{
    return (s_inited != 0u) && (s_appli == 1u || s_appli == 2u);
}

/* ======================================================================
 * 第二階段：串流後端
 *
 * 對外的形狀刻意跟 audio_out.h 的 7 個函式一樣，audio_out.c 在輸出切到
 * USB 時直接轉發過來。**I2S 那條路一個字都沒改**，只多了轉發的判斷。
 * ====================================================================== */
#include "wav_hdr.h"

/* 緩衝：192 x 160 = 30720 bytes = 160 毫秒。
 * **總長一定要整除 192**（一個 USB 訊框的位元組數）—— 類別是一次推進
 * 192 個位元組去繞回的，不整除的話繞回點會落在取樣框中間。
 * 160ms 跟相簿 I2S 那條路同量級（那邊實測 9.5 分鐘零欠載）。 */
#define USB_BLOCK      3072u
#define USB_BLOCKS     10u
#define USB_BUF_TOTAL  (USB_BLOCK * USB_BLOCKS)   /* 30720 = 192 x 160 */

static uint8_t  s_abuf[USB_BUF_TOTAL] __attribute__((aligned(32)));
static uint32_t s_in;                 /* 我們寫到哪 */

static FIL      s_file;
static bool     s_open;
static wav_hdr_t s_hdr;
static uint32_t s_byterate;           /* rate * ch * bits/8 */
static uint32_t s_left;               /* data 區塊還剩幾 bytes 沒讀 */
static uint32_t s_org;                /* 這一段的起點在 data 區塊裡的位移 */
static uint32_t s_sent0;              /* 起點那一刻類別的 global_ptr */
static uint8_t  s_vol_pct = 60u;
static volatile bool s_vol_dirty;     /* 音量變了，播放中要補寫 */
static uint8_t  s_vol_ch = 1u;        /* 補寫走到哪個聲道 */
static bool     s_paused;


/* --- TIM7：8kHz 抽送 ---------------------------------------------------
 * 為什麼不能靠主迴圈：USB 的等時端點要 1000 包/秒，而 USBH_Process 一次
 * 呼叫只送一包 —— 相簿每格影片要 17ms，主迴圈根本餵不動。
 * SOF（1kHz）也不行，實測只送得出 500 包/秒。
 * 完整的實測對照在 projects/usbaudio/README.md。
 *
 * HAL 的 TIM 模組沒開，直接寫暫存器。TIM7 是基本計時器，不佔腳位。
 * **優先權跟 OTG_FS 一樣**：同優先權不互相插隊，兩邊自然序列化。 */
/* --- 二分法開關（board-notes 8.2：二分法比推理快）---------------------
 * 0 = 完全不啟動 TIM7，USBH_Process 只由主迴圈的 nap() 驅動。
 * 這樣聲音會很差（相簿每格影片 17ms，餵不動 1000 包/秒），
 * 但可以一次判定「當機是不是中斷這一側造成的」。
 * 症狀是主迴圈與 TIM7 同時停、而且**沒有 CPU 故障**（故障處理常式已經
 * 會把 CFSR/BFAR 寫進黑盒子，實測那幾格是隨機內容）——
 * 那就是某個優先權 <= 6 的中斷不返回或中斷風暴。 */
#define USB_PUMP_ENABLE  1   /* 0 是凍結二分法時期的遺留 —— 關著的話開播
                              * 序列（住在 TIM7 中斷裡）永遠不會跑：沒有
                              * 解靜音、沒有取樣率、沒有 Play，**完全沒聲音**，
                              * 而 dongle 收不到串流就一直斷線重連（省電）。
                              * 使用者 2026-08-27 實測到的就是這個。 */

#define USB_PUMP_HZ  8000u

static void stream_setup_step(void);   /* 定義在下面，中斷裡要用 */

static void pump_start(void)
{
    uint32_t timclk = HAL_RCC_GetPCLK1Freq() * 2u;   /* APB1 分頻不是 1 */

#if (USB_PUMP_ENABLE == 0)
    return;                       /* 二分法：抽送關掉，全部交給主迴圈 */
#endif
    s_pump_on = true;

    __HAL_RCC_TIM7_CLK_ENABLE();
    TIM7->CR1  = 0u;
    TIM7->PSC  = (timclk / 1000000u) - 1u;           /* 先分到 1MHz */
    TIM7->ARR  = (1000000u / USB_PUMP_HZ) - 1u;
    TIM7->EGR  = TIM_EGR_UG;
    TIM7->SR   = 0u;
    TIM7->DIER = TIM_DIER_UIE;
    HAL_NVIC_SetPriority(TIM7_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(TIM7_IRQn);
    TIM7->CR1  = TIM_CR1_CEN;
}

static void pump_stop(void)
{
    s_pump_on = false;
    TIM7->CR1  = 0u;
    TIM7->DIER = 0u;
    HAL_NVIC_DisableIRQ(TIM7_IRQn);
}

void TIM7_IRQHandler(void)
{
    if ((TIM7->SR & TIM_SR_UIF) != 0u) {
        TIM7->SR = ~TIM_SR_UIF;
        UBOX[UB_PUMPCNT]++;

        /* --- **只在類別已經活著的時候才抽送** ---------------------------
         * USBH_Process 在列舉／重置那幾段會呼叫 USBH_Delay()，而它就是
         * HAL_Delay() —— 忙等 uwTick，而 uwTick 由 SysTick 中斷更新。
         * SysTick 的優先權是 15（最低），TIM7 是 6 —— **SysTick 插不進來，
         * uwTick 永遠不動，HAL_Delay 再也不會回來。**
         * 中斷不返回 = 主迴圈餓死 = 畫面凍住、觸控沒反應、連 PUMPCNT
         * 都停住。實測就是這個形狀，而且要撞上一次重新列舉才會發生
         * （所以「多播幾部影片才當」）。
         *
         * gState == HOST_CLASS 這條路徑裡沒有任何延遲，進中斷是安全的。
         * 其他狀態（列舉、類別請求、重置）留給主迴圈的 nap() 跑。 */
        if (hUsbHostFS.gState != HOST_CLASS) {
            UBOX[UB_NOTCLASS]++;
            return;
        }

        usb_poll();

        /* 開播序列也在這裡跑 —— 見 stream_setup_step() 的說明。 */
        if ((s_state != US_IDLE) && (s_state != US_ENDED) &&
            (s_state != US_PLAYING)) {
            stream_setup_step();
        }

        /* **繞回的所有權在這裡。** 留在主迴圈的話追不上（治具實測 over=225）
         * —— 類別送完整個緩衝之後 cbuf 會繼續往前走，沒人拉回來就會把
         * 緩衝後面的記憶體送出去。 */
        if (USBH_AUDIO_GetOutOffset(&hUsbHostFS) >= (int32_t)USB_BUF_TOTAL) {
            UBOX[UB_OVER]++;
            (void)USBH_AUDIO_ChangeOutBuffer(&hUsbHostFS, &s_abuf[0]);
        }
    }
}

