chunyen627-afk/stm32h7s78-project/projects/album/app_src/usbaudio.c
/* --- 控制傳輸：解靜音與絕對音量 ---------------------------------------
 * 兩件 ST 的類別沒做對的事（治具那邊一個一個量出來的）：
 *   1. **它從來不解除靜音** —— `grep MUTE usbh_audio.c` 是空的。
 *      裝置若處於靜音，主機端會看到一個完美的串流而使用者什麼都聽不到。
 *   2. 它只提供相對的 VOLUME_UP/DOWN，而**裝置的開機預設值不固定**
 *      （同一支耳機實測 -58dB 與 -48dB 都出現過），所以「按 N 下」
 *      不是可重現的設定。這裡算絕對目標直接寫。
 *
 * 音量要寫**有那個控制的聲道**：Feature Unit 的 bmaControls[0]（主聲道）
 * 常常只有靜音沒有音量，寫過去或讀回來都沒有意義。
 *
 * Feature Unit 的編號從原始描述元推導（找輸出端子是喇叭/耳機那一族的，
 * 它的 bSourceID 就是），不要相信中介層的索引記帳。 */
static uint8_t s_fu = 0xFFu;
static uint8_t s_ctlbuf[2];

static void find_feature_unit(void)
{
    const uint8_t *raw = hUsbHostFS.device.CfgDesc_Raw;
    uint16_t have = hUsbHostFS.device.CfgDesc.wTotalLength;
    uint16_t i = 0u;

    s_fu = 0xFFu;
    while ((uint16_t)(i + 2u) <= have) {
        uint8_t blen = raw[i];

        if ((blen < 2u) || ((uint16_t)(i + blen) > have)) { break; }
        /* CS_INTERFACE(0x24) / OUTPUT_TERMINAL(0x03)，wTerminalType 高位 0x03
         * = 喇叭那一族（0x0301 喇叭 / 0x0302 耳機 / 0x0303 頭戴 ...） */
        if ((raw[i + 1u] == 0x24u) && (blen >= 9u) &&
            (raw[i + 2u] == 0x03u) && (raw[i + 5u] == 0x03u)) {
            s_fu = raw[i + 7u];                 /* bSourceID */
            return;
        }
        i = (uint16_t)(i + blen);
    }
}

static USBH_StatusTypeDef ctl_set(uint8_t selector, uint8_t chan,
                                  const uint8_t *val, uint8_t len)
{
    if (s_fu == 0xFFu) { return USBH_FAIL; }

    if (hUsbHostFS.RequestState == CMD_SEND) {
        s_ctlbuf[0] = val[0];
        if (len > 1u) { s_ctlbuf[1] = val[1]; }
        hUsbHostFS.Control.setup.b.bmRequestType =
            (uint8_t)(USB_H2D | USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_CLASS);
        hUsbHostFS.Control.setup.b.bRequest  = UAC_SET_CUR;
        hUsbHostFS.Control.setup.b.wValue.w  =
            (uint16_t)(((uint16_t)selector << 8) | chan);
        hUsbHostFS.Control.setup.b.wIndex.w  = (uint16_t)((uint16_t)s_fu << 8);
        hUsbHostFS.Control.setup.b.wLength.w = len;
    }
    return USBH_CtlReq(&hUsbHostFS, s_ctlbuf, len);
}

/* 把 0~100 對映到裝置自己回報的 min..max。**dB 是對數刻度**，百分比只是
 * 給人調的把手，不要用它去推「應該多大聲」。 */
static int16_t vol_target(uint8_t pct)
{
    AUDIO_HandleTypeDef *h = class_handle();
    int32_t lo, hi;

    if (h == NULL) { return 0; }
    lo = (int16_t)h->headphone.attribute.volumeMin;
    hi = (int16_t)h->headphone.attribute.volumeMax;
    if (pct > 100u) { pct = 100u; }
    return (int16_t)(lo + (((hi - lo) * (int32_t)pct) / 100));
}

/* --- 檔案 -> 緩衝 ------------------------------------------------------ */
static volatile bool s_eof;

void USBH_AUDIO_BufferEmptyCallback(USBH_HandleTypeDef *phost)
{
    (void)phost;
    s_eof = true;      /* 唯一可信的「整段送完了」 */
}

static bool read_block(uint32_t at)
{
    UINT     got = 0;
    uint32_t want = USB_BLOCK;

    if (s_left < want) { want = s_left; }
    if (want == 0u) {
        memset(&s_abuf[at], 0, USB_BLOCK);       /* 尾巴補靜音 */
        return true;
    }
    if (f_read(&s_file, &s_abuf[at], want, &got) != FR_OK) {
        UBOX[UB_RDERR]++;
        return false;
    }
    if (got < USB_BLOCK) {
        memset(&s_abuf[at + got], 0, USB_BLOCK - got);
    }
    s_left -= got;
    return true;
}

static void prefill(void)
{
    uint32_t k;

    s_in = 0u;
    for (k = 0u; k < USB_BLOCKS; k++) {
        (void)read_block(k * USB_BLOCK);
    }
    s_in = 0u;
}

/* --- 取得類別控制代碼：**一定要檢查 pActiveClass** ---------------------
 * dongle 拔掉或重新列舉的時候 pActiveClass 會變成 NULL，直接
 * `pActiveClass->pData` 就是對 NULL 解參照 -> HardFault -> 整台凍住，
 * 連中斷都停（實測：主迴圈與 TIM7 在同一毫秒一起停）。
 * 「多播幾部影片才當」正是這個形狀 —— 要撞上一次重新列舉才會發生。 */
static AUDIO_HandleTypeDef *class_handle(void)
{
    if (hUsbHostFS.gState != HOST_CLASS) { return NULL; }
    if (hUsbHostFS.pActiveClass == NULL)  { return NULL; }
    return (AUDIO_HandleTypeDef *)hUsbHostFS.pActiveClass->pData;
}

static uint32_t class_sent(void)
{
    AUDIO_HandleTypeDef *h = class_handle();

    return (h != NULL) ? h->headphone.global_ptr : 0u;
}

bool usbaudio_wav_start(const char *path, uint32_t volume)
{
    usbaudio_wav_stop();

    if (!usbaudio_ready()) { return false; }

    UBOX[UB_UNDER] = 0u;
    UBOX[UB_OVER]  = 0u;
    UBOX[UB_RDERR] = 0u;

    UBOX[UB_STARTS]++;
    if (f_open(&s_file, path, FA_READ) != FR_OK) { return false; }
    s_open = true;

    if (!wav_hdr_parse(&s_file, &s_hdr)) { usbaudio_wav_stop(); return false; }

    /* 只吃 48kHz / 立體聲 / 16-bit。**不要嘗試轉換** —— 影片音軌一律是
     * 這個格式（video2bin.py 就是這樣輸出的），而且那是相容性最好的格式。
     * 不符就回 false，呼叫端會退回 I2S 或靜音，不會發出怪聲。 */
    if (s_hdr.rate != 48000u || s_hdr.channels != 2u || s_hdr.bits != 16u) {
        usbaudio_wav_stop();
        return false;
    }
    s_byterate = s_hdr.rate * s_hdr.channels * (s_hdr.bits / 8u);

    s_left    = s_hdr.data_len;
    s_org     = 0u;
    s_paused  = false;
    s_eof     = false;
    s_vol_pct = (uint8_t)((volume > 100u) ? 100u : volume);

    find_feature_unit();
    prefill();

    s_state = US_UNMUTE;
    UBOX[UB_STREAM] = s_state;
    pump_start();          /* 序列在中斷裡跑，所以現在就要啟動 */
    return true;
}

/* --- 開播序列：**在 TIM7 的中斷裡跑** ---------------------------------
 * 第一版放在 usbaudio_wav_pump()（主迴圈）裡，結果「播放要先暫停聲音才
 * 會出來」—— 因為**影片播放迴圈不經過 nap()**，`USBH_Process` 沒人跑，
 * 這串非同步的控制傳輸就停在半路；一暫停，暫停迴圈有 nap()，序列才走完。
 *
 * 搬進中斷同時解決兩件事：
 *   1. 序列不再依賴呼叫端的迴圈有多快
 *   2. **USB 的狀態機只有一個擁有者** —— 控制傳輸與 USBH_Process 在同一個
 *      執行環境，不會互相踩。治具那邊我就是敗在從主迴圈跟類別搶
 *      phost->Control，連續三輪量到三個不同的 alt。
 *
 * 檔案 I/O 留在主迴圈（FatFs 不能進中斷），見 usbaudio_wav_pump()。 */
static void stream_setup_step(void)
{
    static const uint8_t zero = 0u;

    switch (s_state) {

    case US_UNMUTE:
        if (ctl_set(MUTE_CONTROL, 0u, &zero, 1u) != USBH_BUSY) {
            s_state = US_VOL1;          /* 不支援就跳過，不要卡住 */
        }
        break;

    case US_VOL1:
    case US_VOL2: {
        int16_t t = vol_target(s_vol_pct);
        uint8_t v[2];

        v[0] = (uint8_t)((uint16_t)t & 0xFFu);
        v[1] = (uint8_t)(((uint16_t)t >> 8) & 0xFFu);
        if (ctl_set(VOLUME_CONTROL, (s_state == US_VOL1) ? 1u : 2u,
                    v, 2u) != USBH_BUSY) {
            s_state = (s_state == US_VOL1) ? US_VOL2 : US_FREQ;
        }
        break;
    }

    case US_FREQ:
        /* 取樣率是非同步控制傳輸，第一次一定回 USBH_BUSY —— 那不是因為
         * 傳輸還沒完成，是因為它要求 play_state 是 IDLE 而類別剛掛上時
         * 是 INIT。重試到 OK。 */
        if (USBH_AUDIO_SetFrequency(&hUsbHostFS, (uint16_t)s_hdr.rate,
                                    (uint8_t)s_hdr.channels,
                                    (uint8_t)s_hdr.bits) == USBH_OK) {
            s_state = US_PLAY;
        }
        break;

