chunyen627-afk/stm32h7s78-project/projects/album/app_src/usbaudio.c
    case US_PLAY:
        /* USBH_AUDIO_Play 要求 play_state == IDLE，而 SetFrequency 只是把
         * 類別推進 SET_EP，那筆傳輸完成之後才回到 IDLE。**主動重試到 OK**
         * ——不要等 FrequencySet 回呼，那是一場撞不撞得上的競爭。 */
        if (USBH_AUDIO_Play(&hUsbHostFS, &s_abuf[0],
                            s_hdr.data_len - s_org) == USBH_OK) {
            s_sent0 = class_sent();
            s_state = US_PLAYING;
        }
        break;

    default:
        break;
    }
    UBOX[UB_STREAM] = s_state;
}

/* **從主迴圈呼叫。** 只做檔案 I/O（FatFs 不能進中斷）。
 * 開播序列與封包送出都在 TIM7 的中斷裡。 */
void usbaudio_wav_pump(void)
{
    UBOX[UB_TICK] = HAL_GetTick();
    UBOX[UB_PUMPCALLS]++;
    if (s_state != US_PLAYING) { return; }
    {
        int32_t out = USBH_AUDIO_GetOutOffset(&hUsbHostFS);
        int32_t diff;

        if (s_eof) { s_state = US_ENDED; return; }

        /* 播放中改音量：一次寫一個聲道，寫完就清旗標。
         * 兩個聲道要分開寫，而且中間不能插進別的控制傳輸 ——
         * 治具實測「前一步還沒做完就發下一步」會讓兩個聲道走散，
         * 聽起來就是左右換來換去。 */
        if (s_vol_dirty) {
            int16_t t = vol_target(s_vol_pct);
            uint8_t v[2];

            v[0] = (uint8_t)((uint16_t)t & 0xFFu);
            v[1] = (uint8_t)(((uint16_t)t >> 8) & 0xFFu);
            if (ctl_set(VOLUME_CONTROL, s_vol_ch, v, 2u) != USBH_BUSY) {
                if (s_vol_ch == 1u) {
                    s_vol_ch = 2u;
                } else {
                    s_vol_ch = 1u;
                    s_vol_dirty = false;
                }
            }
        }

        if (out < 0) { return; }        /* 還沒真的開始送 */

        diff = out - (int32_t)s_in;
        if (diff < 0) { diff += (int32_t)USB_BUF_TOTAL; }

        if ((uint32_t)((int32_t)USB_BUF_TOTAL - diff) < (USB_BUF_TOTAL / 4u)) {
            UBOX[UB_UNDER]++;           /* 存量掉到 1/4 以下 = 掏空的前兆 */
        }

        /* **while，不是 if。** 相簿每格影片 17ms 才回來一次，一次只補一塊
         * 一定跟不上；補到追上為止（單次最多補半個緩衝）。 */
        while (diff >= (int32_t)(USB_BUF_TOTAL / 2u)) {
            s_in += USB_BLOCK;
            if (s_in >= USB_BUF_TOTAL) { s_in = 0u; }
            if (!read_block(s_in)) { break; }
            diff -= (int32_t)USB_BLOCK;
        }
        UBOX[UB_POSMS] = usbaudio_wav_pos_ms();
    }
}



bool usbaudio_wav_active(void)
{
    return (s_state != US_IDLE) && (s_state != US_ENDED);
}

void usbaudio_wav_stop(void)
{
    UBOX[UB_STOPS]++;
    if (s_state != US_IDLE) {
        pump_stop();
        (void)USBH_AUDIO_Stop(&hUsbHostFS);
    }
    s_state = US_IDLE;
    if (s_open) { (void)f_close(&s_file); s_open = false; }
    s_paused = false;
    UBOX[UB_STREAM] = s_state;
}

void usbaudio_wav_pause(bool on)
{
    UBOX[UB_PAUSES]++;
    if (s_state != US_PLAYING) { return; }
    if (on == s_paused) { return; }
    s_paused = on;
    if (on) {
        (void)USBH_AUDIO_Suspend(&hUsbHostFS);
    } else {
        (void)USBH_AUDIO_Resume(&hUsbHostFS);
    }
}

uint32_t usbaudio_wav_len_ms(void)
{
    if (s_byterate == 0u) { return 0u; }
    return (uint32_t)(((uint64_t)s_hdr.data_len * 1000u) / s_byterate);
}

uint32_t usbaudio_wav_pos_ms(void)
{
    uint32_t bytes;

    if (s_byterate == 0u) { return 0u; }
    if (s_state < US_PLAYING) { return (uint32_t)(((uint64_t)s_org * 1000u) / s_byterate); }

    bytes = s_org + (class_sent() - s_sent0);
    if (bytes > s_hdr.data_len) { bytes = s_hdr.data_len; }
    return (uint32_t)(((uint64_t)bytes * 1000u) / s_byterate);
}

bool usbaudio_wav_seek_ms(uint32_t ms)
{
    uint32_t off;

    UBOX[UB_SEEKS]++;
    UBOX[UB_SEEKSTEP] = 1u;
    if (!s_open || s_byterate == 0u) { return false; }

    /* 對齊到取樣框（4 bytes）。**沒對齊的話左右聲道會對調** ——
     * ST 範例栽在這裡（偏移 34 不是 4 的倍數），症狀是刺耳的雜訊。 */
    off = (uint32_t)(((uint64_t)ms * s_byterate) / 1000u) & ~3u;
    if (off > s_hdr.data_len) { off = s_hdr.data_len & ~3u; }

    /* --- **不要在這裡停抽送。** ----------------------------------------
     * 開播序列住在 TIM7 的中斷裡；停掉抽送而忘了再啟動，序列就永遠不會
     * 重跑，狀態卡在 US_UNMUTE、active() 一直回 true，相簿等在那裡不動。
     * 第一版就是這樣：「滑到影片中間、之後暫停就當」。
     *
     * 抽送一直開著是安全的 —— 類別停播之後它就沒東西可送。
     * 順序也重要：**先把狀態放倒、填好緩衝，最後才讓序列重跑**，
     * 不然中斷可能在緩衝只填一半的時候就把它送出去。 */
    s_state = US_IDLE;
    (void)USBH_AUDIO_Stop(&hUsbHostFS);
    UBOX[UB_SEEKSTEP] = 2u;

    if (f_lseek(&s_file, s_hdr.data_off + off) != FR_OK) {
        UBOX[UB_STREAM] = s_state;
        return false;
    }

    UBOX[UB_SEEKSTEP] = 3u;
    s_left = s_hdr.data_len - off;
    s_org  = off;
    s_eof  = false;
    prefill();
    UBOX[UB_SEEKSTEP] = 4u;

    s_state = US_UNMUTE;                /* 填好了才讓序列重跑 */
    if (!s_pump_on) { pump_start(); }
    UBOX[UB_STREAM] = s_state;
    UBOX[UB_SEEKSTEP] = 5u;
    return true;
}

void usbaudio_set_volume(uint32_t pct)
{
    s_vol_pct = (uint8_t)((pct > 100u) ? 100u : pct);
    s_vol_dirty = true;
    /* **不要把狀態退回 US_VOL1。** 那樣會把整串開播序列重跑一遍，
     * 包含再呼叫一次 USBH_AUDIO_Play —— 播放中改音量不該碰開播流程。
     * 由 US_PLAYING 裡的 s_vol_dirty 處理。 */
}

/* 註：這裡曾經覆寫 MX_SDMMC1_SD_Init 把 SDMMC 時脈降到 1/2 與 1/8
 * （ST 社群對「USB 一開 SD 就卡住」的標準診斷）—— **兩個都沒有幫助**，
 * 所以頻寬競爭不是原因，覆寫也就拿掉了（降速是有代價的）。 */
